app/Controllers/Main.php

    public function login_submit()
    {
        // form validation
        $validation = $this->validate(
            // validation rules
            [
                'text_usuario' => 'required',
                'text_senha' => 'required',
            ],
            // validation errors
            [
                'text_usuario' => [
                    'required' => 'O campo usuário é obrigatório'
                ],
                'text_senha' => [
                    'required' => 'O campo senha é obrigatório'
                ],
            ]
    );

    if(!$validation) {
        return redirect()->to('login')->withInput()->with('validation_errors', $this->validator->getErrors());
    }

        // check if login is valid
        $usuario = $this->request->getPost('text_usuario');
        $senha = $this->request->getPost('text_senha');

        $users_model = new UsersModel();
        $users_data = $users_model->where('usuario', $usuario)->first();
---
SELECT *
FROM `users`
WHERE `usuario` = 'user1'
 LIMIT 1

    public function admin()
    {
        $data = [];

        $usuarios_model = new UsuariosModel();
        $data['usuarios'] = $usuarios_model->findAll();
---
SELECT *
FROM `usuarios`

    public function usuario_details($enc_id)
    {
        // decrypt usuario id
        $usuario_id = decrypt($enc_id);
        if(!$usuario_id) {
            return redirect()->to('/');
        }

        // load usuario data
        $usuarios_model = new UsuariosModel();
        $usuario_data = $usuarios_model->where('id', $usuario_id)->first();
---
SELECT *
FROM `usuarios`
WHERE `id` = '1'
 LIMIT 1

    public function create_pdf_report()
    {
       // get usuarios
        $usuarios_model = new UsuariosModel();
        $usuarios = $usuarios_model->findAll();
---
SELECT *
FROM `usuarios`